-- scriptTest.lua (in your scripts directory)
local M = {}
   
function wSignal(_event)
	arr = {
		[1] = 'В этом промежутке ранее была покупка',  
		[2] = 'Продали по текущей цене в этом промежутке',  
		[3] = 'Цена падает, покупка не возможна',  
		[4] = 'buy is off',  
		[5] = 'Очень большая цена',  
		[6] = 'Режим эмуляции',  
		[7] = 'Выставили на продажу контракт',  
		[8] = 'Продали контракт',  
		[9] = 'Поставили заявку на продажу',  
		[10] = 'на продажу',  
		[11] = 'Заявка на продажу(покупка) была не исполнена', 
		[12] = 'У нас стоит заявка на продажу по текущей цене',   
		[13] = 'Текущая свеча меньше преполагаемого профита, низкая волатильность',  
		[14] = 'Цена на свече выше профита, покупка на верху невозможна',   
		[15] = 'Логирование ошибок',   
		[16] = 'Нет свободных контрактов на покупку, надо продать старые',   
		[17] = 'Мы продали много контрактов подряд, ушли в лимит продажи',   
		[18] = 'Падение рынка, сработала автоматическаяя блокировка покупок',  
		[19] = 'Покупка запрещена, высоки диапазон покупок',   
		[20] = 'Купили контракт в режиме эмуляции',   
		[21] = 'Продали контракт в режиме эмуляции',   
		[22] = 'Выставили контракт на продажу в режиме эмуляции', 
		[23] = 'Выставили контракт на покупку',    
		[24] = 'Выставили и продали контракт в режиме эмуляции',    
		[25] = 'Лимит заявок в режиме эмуляции',    
		[26] = 'Продали контракт',   
		[27] = 'Исполнили покупку контракта',  
		[28] = 'Ставим стоп заявку в режиме эмуляции', 
		[29] = 'Ставим стоп заявку',   
	}
	 
	return arr[_event];
end;

    
function word(key)
	

 
	arr = {	  
		['stop_add_contract'] = "Добавить контрактов к стопам",
		['stop_count_contract'] = "Количество стопов",
		['stop_range_price'] = "Расстояние до макс. покупки",
		['stop_range_price_stop'] = "Расстояние между стопами",
		['stop_contract_work'] = " в работе",
		['stop_from_price'] = " от цены ",

		['add'] = "       прибавить",
		['minus'] = "       убавить",
		['bablo'] = "                   БАБЛО",
		['emulation'] = "     эмуляция",
		['current_limit_max'] = "Макс. кол. контрактов за раз",
		['current_limit'] = "Максимальный лимит контрактов",
		['SPRED_LONG_TREND_DOWN'] = "Ц. вниз: Расстояние от покупки",
		['SPRED_LONG_TREND_DOWN_SPRED'] = "Ц. вниз: Увеличение с покупкой",
		['profit_take_max_range'] = "Тэйк: Отступ от max",
		['profit_take_protected'] = "Тэйк: Защитный спред",
		['profit_range'] = "Объём профита",
		['sell_set_take_or_limit'] = "Продажа (тейк или лимит)",
		['sell_set_take_profit'] = "тейк профит",
		['sell_set_limit'] = "лимит",
		['sell_set_take_or_limit_change'] = "       Изменить",

		['buy_block'] = "Блокировка покупок",
		['not_buy_high'] = "Вверх коридора покупок",
		['not_found_tag'] = "В своиство графика необходимо добавить \"" .. setting.tag .."\".  Откройте график и в области Price перейдите в вкладку дополнительно, в самом низу есть поле 'Идентификатор', туда и добавьте " .. setting.tag ..". После нажмите Применить и перезапустите робота" ,  
	}
	 
	return arr[key];
end;
 
M.word = word; 
M.wSignal = wSignal; 
return M