-- Перед тем чтоб робота перевести робота в боевой режим, посмотрите работу робота XoraX в режиме эмуляции
-- Следите за объёмом и рисками
-- Не гонитеь за большими заработками
-- Удачи...
-- @xorax <=> @koras

-- счёт клиента, как вариант его можно узнать в зваяках в таблице заявок
setting.ACCOUNT =  '4105F8Y';  

-- класс бумаги. У фьючерсов в основном он одинаков
setting.CLASS_CODE =  "SPBFUT";  

-- код бумаги. Название бумаги разная от месяца к месяцу 
setting.SEC_CODE =  "BRN0" ; 

-- тег графика, необходимо указывать в том графике из которого робот будет получать данные. 
-- график нужен в минутном таймфрейме(обязательно)
setting.tag = "my_br";  
 